<template>
  <div class="collage-article-container">
    <div class="collage-article-box">
      <img :src="collageArticle.src" />
      <p>北京社会管理职业学院（民政部培训中心）（以下简称学院）是经教育部和北京市人民政府审定核准独立设置的普通高职院校，隶属于国家民政部，前身是1959年成立的内务部干部学校。1983年11月，经民政部批准，成立民政部管理干部学院。1995年5月，民政部成立民政部培训中心，与学院合署办公。1997年9月，中国假肢矫形技术中等专业学校并入学院。2007年6月，经北京市人民政府批准，组建北京社会管理职业学院。2010年9月，经中央机构编制委员会核准，民政部管理干部学院、民政部培训中心、中国假肢矫形培训中心、北京社会管理职业学院整合为北京社会管理职业学院，并加挂民政部培训中心牌子。学院以培养社会管理和社会服务类高水平技术技能人才为目标，主要承担社会管理和社会服务类高等职业教育、全国民政系统干部职工教育培训、民政职业技能等级认定、民政政策理论研究和民政领域国家职业技能标准制定等方面的重要职能。</p>
      <p>学院坚持以习近平新时代中国特色社会主义思想为指导，深入学习贯彻党的二十大精神、习近平总书记关于职业教育和民政工作的重要指示精神，全面贯彻党的教育方针，坚持为党育人、为国育才，坚持立德树人根本任务，牢牢把握社会主义办学方向，实施“质量立校、特色强校”的发展战略，持续推进内涵建设，不断提升关键办学能力，服务民政事业高质量发展、北京“四个中心”建设和京津冀协同发展，先后荣获“中央文明单位”“国家技能人才培育突出贡献单位”“全国民族团结进步模范集体”“首都文明单位”“首都精神文明单位”等20多项荣誉。学院作为培养民政行业高级人才的摇篮、开展民政政策理论和科学技术研究的智库、为民政系统和全社会提供相关技术标准支撑的阵地、展示民政文化魅力的窗口，努力为建设教育强国、人力资源强国和技能型社会贡献力量。</p>
      <p>学院现有北京大兴和河北燕郊两个校区，占地面积903亩，总建筑面积24.04万平米，教学科研行政用房9.78万平米，教学科研仪器设备总值达9000万元以上。拥有省部级重点实验室2个，国家级技能大师工作室2个，160多间专业实训室以及300多家校企深度合作的校外实训基地。建有专业标准的体育馆和图书馆，其中图书馆藏图书十分丰厚，是一所集现代化、数字化、园林化为一体的智慧校园。</p>
      <p>学院面向全国招生，就业率超过95%。同时，每年还承担着1万余人次的在职民政干部培训任务。学院围绕民政行业与民生民政重点服务领域，建成健康养老、康复辅助技术、儿童服务与发展、殡葬服务等高水平专业群，开设智慧健康养老服务与管理、现代殡葬技术与管理、康复治疗技术、康复辅助器具技术、学前教育、护理、社会工作、社区管理与服务、婚庆服务与管理等20个涵盖民政各个领域、社会亟需的特色专业。其中，智慧健康养老服务与管理、护理、社会工作、现代殡葬技术与管理、学前教育、康复辅助器具技术、婚庆服务与管理等7个专业被认定为教育部高等职业教育创新发展行动计划骨干专业；健康养老专业群、现代殡葬技术与管理专业、康复辅助技术专业群入选北京市特色高水平骨干专业（群）；海涛生命服务学院、格林彩虹矫形工程师学院入选北京市工程师学院。设有老年福祉学院、社会工作学院、康复工程学院、儿童教育与发展学院、生命文化学院、婚礼文化与传媒艺术学院六个二级学院以及思想政治理论教研部、培训部（继续教育学院）等教学单位。作为全国首批养老服务类专业示范点单位、全国首批现代学徒制行业试点单位和教育部残疾人康复人才培养改革试点单位，学院自开展学历教育以来，已为民生民政领域培养了近15000名高水平技术技能人才。</p>
      <p>学院高级职称教师占比35.7%；硕士及以上学位教师占比98%,其中，博士学位占比16%。全国技术能手1人，国家技能人才培育突出贡献个人1人，国家级创新团队1个，民政部技能大师工作室1个，北京市教学名师、优秀教师8人，北京市职教名师3人，北京市专业带头人4人，北京市优秀青年骨干教师14人，国家级教学创新团队1个，北京市专业创新团队3个。近年来，学院教师团队先后荣获国家级职业教育教学成果一等奖1项、二等奖1项，北京市职业教育教学成果特等奖2项、一等奖1项、二等奖5项。获得全国职业院校技能大赛教学能力比赛一等奖1项、二等奖1项，北京市职业院校技能大赛教学能力比赛一等奖6项、二等奖14项、三等奖21项。教育部国家级课程思政示范课1门，北京市课程思政示范课1门，全国首届优秀教材评选二等奖1项。</p>
      <p>学院深化“三教”改革，创新实施中国特色学徒制、双元制、订单式等校企协同、工学结合的人才培养模式，强化政校企合作，形成“岗课赛证”综合育人机制。着力构建起德智体美劳全面发展的人才培养体系，学生荣获全国职业院校技能大赛等国家级二类以上技能竞赛一等奖45项，全国其他大赛一等奖20项。2009级1名毕业生获第32届“北京青年五四奖章”，2010级1名毕业生被共青团中央授予“全国青年岗位能手”的称号，毕业生先后荣获全国先进工作者、民政部最高荣誉奖“孺子牛奖”。学院实行开放式办学战略，实施“全面合作办学、全程合作培养、全员合作就业”的人才培养机制。与美国、加拿大、英国、德国、挪威、澳大利亚、新西兰、日本、香港、台湾等国家或地区的20余所高校建立校际交流和合作关系，定期开展师生互访和培训活动。</p>
      <p>学院作为全国民政职业教育教学指导委员会秘书处，承担行指委的日常工作。与民政部遴选的智慧健康养老应用试点示范企业、街道（乡镇）、基地、全国社会工作服务示范地区、社区和单位以及国家康复辅助器具综合创新试点地区进行紧密合作，共同培养民政领域专业技术技能人才。</p>
      <p>作为民政系统唯一的国家级干部培训基地，民政部培训中心坚持干部培训、高职教育、科学研究、职业技能等级评价、“1+X”证书试点统筹规划布局，获批为“国家级职业教育双师型教师培训基地”“国家专业技术人员继续教育基地”“国家社会工作专业人才培训基地”“中国残疾人康复人才培养北京基地”“全国社会组织教育培训基地”“北京市养老服务人才教育培训学院”“北京市职工继续教育基地”等七大教育培训基地，先后为民政系统各部门各领域培养和输送了20余万名各级领导干部、业务骨干、行业能手和专业人才，累计鉴定民政行业特有工种人才近20万人次。举办了10届全国民政行业职业技能竞赛和1届全国养老护理职业技能大赛，累计选拔产生了68名全国技术能手，同时选拔了近千名养老护理、孤残儿童护理、康复辅具服务、殡葬服务等领域的高技能人才，促进民政行业逐步形成了一支素质优良、结构合理的职业技能人才队伍，被誉为“民政人才的摇篮”。</p>
      <p>站在新的历史起点，承载着新时代赋予的使命，学院全体师生将在民政部党组的坚强领导下，以习近平新时代中国特色社会主义思想为指导，全面贯彻党的教育方针，积极落实全国职业教育大会精神和“职教20条”精神，坚持新发展理念，不断提高服务新时代民政事业的能力，积极创新，勇于担当，为实现建设特色鲜明、行业领先、国内一流、国际知名的高水平民政职业院校的愿景而努力奋斗。</p>
      <p>（注：以上数据截止到2023年3月）</p>
    </div>
  </div>
</template>

<script>
import { ref } from 'vue'

export default {
  name: 'CollegeIntroduceIndex',
  setup () {
    const collageArticle = ref({
      src: require('@/assets/images/5.jpg')
    })

    return {
      collageArticle
    }
  }
}
</script>

<style lang="less" scoped>
.collage-article-container {
  padding-top: 60px;
  padding-left: 40px;
  .collage-article-box {
    img {
      float: right;
      width: 300px;
      height: 200px;
    }
    p {
      font-size: 20px;
      text-indent:2em
    }
  }
}
</style>
