<template>
  <div class="home-carousel-container">
    <el-carousel>
      <el-carousel-item v-for="item in HomeCarouselList" :key="item.name">
        <el-row :gutter="20">
          <el-col :span="12">
            <div class="img-box">
              <img class="img" :src="item.src" />
            </div>
          </el-col>
          <el-col :span="12">
            <div class="info-box">
              <router-link class="article-title" :to="item.link">{{item.title}}</router-link>
              <span v-if="activeTabs=true">{{item.date}}123</span>
              <span v-if="activeTabs=false">{{item.date}}456</span>
              <span>{{item.txt}}</span>
            </div>
          </el-col>
        </el-row>
      </el-carousel-item>
    </el-carousel>
  </div>
</template>

<script>
import { reactive, ref, watch } from 'vue'

export default {
  name: 'HomeCarouselIndex',
  props: {
    changeTabs: {
      type: Boolean,
      default: true
    }
  },
  setup (props) {
    const activeTabs = ref(true)
    console.log(props)
    watch(
      // 监听是否可展示
      () => props.changeTabs,
      (newVal, oldVal) => {
        console.log('改变的值', newVal)
        activeTabs.value = newVal
        this.$forceUpdate()
      }
    )
    const HomeCarouselList = reactive([
      {
        name: 'first',
        src: require('@/assets/images/5.jpg'),
        link: '/',
        title: '毕业典礼',
        date: '2023-07-20',
        txt: '北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...'
      },
      {
        name: 'first',
        src: require('@/assets/images/autumn-7562289_960_720.jpg'),
        link: '/',
        title: '毕业典礼',
        date: '2023-07-20',
        txt: '北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...'
      },
      {
        name: 'first',
        src: require('@/assets/images/sunrise-7493833_1280.jpg'),
        link: '/',
        title: '毕业典礼',
        date: '2023-07-20',
        txt: '北京社会管理职业学院隆重举行2023届毕业典礼。北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...'
      },
      {
        name: 'first',
        src: require('@/assets/images/sunset-7504891_960_720.jpg'),
        link: '/',
        title: '毕业典礼',
        date: '2023-07-20',
        txt: '北京社会管理职业学院隆重举行2023届毕业典礼。北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...北京社会管理职业学院隆重举行2023届毕业典礼。党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...党委书记邹文开出席毕业典礼，院长王胜三出席典礼并讲话，副院长梅玉保、赵红岗、王丽娟出席典礼。典礼由副院长栗演兵主持。典礼上，赵红岗宣...'
      }
    ])

    return {
      HomeCarouselList,
      activeTabs
    }
  }
}
</script>

<style lang="less" scoped>
.home-carousel-container {
  .el-carousel__container {
    .el-carousel__item {
      .img-box {
        height: 300px;
        .img {
          width: 100%;
          height: 100%;
          object-fit: cover;
        }
      }
      .info-box {
        display: flex;
        flex-direction: column;
        .article-title {
          display: block;
          color: #00040c;
        }
        .router-link-active {
          text-decoration: none;
        }
        span {
          display: -webkit-box;
          margin-top: 20px;
          color: #948a8a;
          text-align: justify;
          line-height: 2;
          overflow: hidden;
          text-overflow: ellipsis;
          -webkit-box-orient: vertical;
          -webkit-line-clamp: 5;
        }
      }
    }
  }
  :deep(.el-carousel__container) {
    height: 300px;
  }
  // 修改Element Plus轮播图横线指示器，变为圆点
  :deep(.el-carousel__indicator.is-active button) {
    width: 15px;
    height: 15px;
    background: transparent;
    border: 2px solid #7b6c6c;
    border-radius: 50%;
    opacity: 0.8;
  }
  :deep(.el-carousel__indicator--horizontal button) {
    width: 10px;
    height: 10px;
    background: #0e0d0d;
    border-radius: 50%;
    opacity: 1;
  }
}
</style>
